#define  _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>//scanf 函数头文件
#include <string.h>//(引用头文件 - strlen - 计算字符串数量)
#include <windows.h>//Sleep 函数的头文件 -用于休眠
#include <stdlib.h>//---rand函数的实现引用的头文件
#include <time.h>//时间戳


//                                                             一维数组

//数组 - 一组数 - 一组相同类型元素的集合
// 
//一维数组的创建和初始化

//数组的创建方式：
//type_t  arr_name   [const_n]
//type_t 是指数组的元素类型
//const_n 是一个"常量表达式"，用来指定数组的大小

//如：int arr[8]   ;   char ch[5]

//数组的初始化
//int a = 10; //初始化
//int arr[10] = {1,2,3,4,5,6,7,8,9,10};  //完全初始化
//int arr[10] = {1,2,3,4,5,6}; //不完全初始化
//int arr2[] = {1,2,3,4,5,6}; //当括号内没有元素个数时候，会根据后面大括号内元素个数来确定个数

//字符数组
//char ch1[5] = { 'a', 'b', 'c' };  //元素 - a  b  c  \0  \0
//char ch2[] = { 'a', 'b', 'c' };   //元素 - a  b  c   
//printf("$d\n", ch2); //随机值

//字符串
//char ch3[5] = "ue"; //字符串 - u  e  \0  \0  \0 - 五个元素
//char ch4[] = "ue"; //字符串 - u  e  \0  - 三个元素


//int main()
//{
//	int arr[10] = { 0 };//不完全初始化- 第一个放0后续全部是0
//
//	arr[4] = 5;//[] - 下标引用
//	int i = 0;
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	for (i = 0; i < sz; i++)
//	{
//		printf("%d ", arr[i]);
//	}
//	return 0;
//}


//一维数组的存储

//%p 是按地址的格式来打印 - 十六进制的打印
//int main()
//{
//	int arr[10] = { 0 };
//	int i = 0;
//	for (i = 0; i < 10; i++)
//	{
//		printf("&arr[%d] = %p\n", i,  &arr[i]);
//	}
//
//	return 0;
//}

//1.一维数组在内存中是连续存放的；
//2.随着数组下标的增长，地址是由低到高变化的；

// -- 1.
//int main()
//{
//	int arr[10] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };
//	int* p = arr;//数组名是数组首元素的地址；
//	int i = 0;
//	for (i = 0; i < 10; i++)
//	{
//		printf("%d ", *p);
//		p++;
//	}
//
//	return 0;
//}



//                                                                    二维数组

//int main()
//{
//	//二维数组初始化
//	//int arr[3][4];//三行四列
//	//char ch[3][10];
//
//	//初始化 - 创建的同时给赋值
//	//int arr[3][4] = { 1,2,3,4,5,6,7,8,9,10,11,12 }; //按照第一行开始填入，直到填完；
//	//int arr[3][4] = { 1,2,3,4,5,6 };//按照第一行开始填入，元素填完开始补0； - 不完全初始化
//	//如果是字符串则后面没有自负的情况补 \0;
//
//	//int arr[3][4] = { {1, 2}, {3, 4}, {5, 6} };//每一行进行填充，不够的填入0；
//
//
//
//	return 0;
//}

//二维数组的行数不可省略，但是列数可省略；
//在二维数组中，如果进行查询，每行列都是和下标一样从零开始；

//如何打印二维数组
//int main()
//{
//	int arr[3][4] = { {1, 2}, {3, 4}, {5, 6} };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < 3; i++)
//	{
//		for (j = 0; j < 4; j++)
//		{
//			printf("%d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//	return 0;
//}


//二维数组在数组中怎么存储
//二维数组在内存中也是连续存储的- 跨行也是连续存储；
//int main()
//{
//	int arr[3][4] = { {1, 2}, {3, 4}, {5, 6} };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < 3; i++)
//	{
//		for (j = 0; j < 4; j++)
//		{
//			printf(" & arr[% d][% d] = % p\n", i, j, &arr[i][j]);
//		}
//	}
//	return 0;
//}


//利用指针来打印
int main()
{
	int arr[][4] = { {1, 2}, {3, 4}, {5, 6} };
	int i = 0;
	int j = 0;
	int* p = &arr[0][0];
	for (i = 0; i < 12; i++)
	{
		printf("%d ", *p);
		p++;
	}
	return 0;
}











































